"""
Алла ошиблась при копировании из одной структуры данных в другую.
Она хранила массив чисел в кольцевом буфере. Массив был отсортирован по
возрастанию, и в нём можно было найти элемент за логарифмическое время.
Алла скопировала данные из кольцевого буфера в обычный массив, но сдвинула
данные исходной отсортированной последовательности. Теперь массив не является
отсортированным. Тем не менее, нужно обеспечить возможность находить в нем
элемент за O(log n).
Можно предполагать, что в массиве только уникальные элементы.

От вас требуется реализовать функцию, осуществляющую поиск в сломанном массиве.
Файлы с заготовками кода, содержащими сигнатуры функций и базовый тест для
поддерживаемых языков, находятся на Яндекс.Диске по ссылке.
Обратите внимание, что считывать данные и выводить ответ не требуется.
Разрешение файла должно соответствовать языку, на котором вы пишете
(.cpp, .java, .go, .js, .py). Если вы пишете на Java, назовите файл с
решением Solution.java, для C# – Solution.cs. Для остальных языков название
может быть любым, кроме solution.ext, где ext – разрешение для вашего языка.

Формат ввода
Функция принимает массив натуральных чисел и искомое число k.
Длина массива не превосходит 10000. Элементы массива и число k  не превосходят
по значению 10000.
В примерах:
В первой строке записано число n — длина массива.
Во второй строке записано положительное число k — искомый элемент.
Далее в строку через пробел записано n натуральных чисел – элементы массива.

Формат вывода
Функция должна вернуть индекс элемента, равного k, если такой есть в массиве
(нумерация с нуля). Если элемент не найден, функция должна вернуть −1.
Изменять массив нельзя.

Для отсечения неэффективных решений ваша функция будет запускаться от 100000
до 1000000 раз.
"""


def broken_search(pArray, value) -> int:
    lb = 0
    rb = len(pArray) - 1
    while lb <= rb:
        mid = (lb + rb) // 2
        if pArray[mid] == value:
            return mid
        if pArray[mid] < pArray[rb]:
            if pArray[mid] < value <= pArray[rb]:
                lb = mid + 1
            else:
                rb = mid - 1
        else:
            if pArray[lb] <= value < pArray[mid]:
                rb = mid - 1
            else:
                lb = mid + 1
    return -1


if __name__ == '__main__':
    n = int(input())
    k = int(input())
    iData = list(map(int, input().split()))
    try:
        kId = iData.index(k)
    except ValueError:
        kId = -1
    print(kId, broken_search(iData, k))

