"""
Алла получила задание, связанное с мониторингом работы различных серверов.
Требуется понять, сколько времени обрабатываются определённые запросы на
конкретных серверах. Эту информацию нужно хранить в матрице, где номер
столбца соответствуют идентификатору запроса, а номер строки — идентификатору
сервера. Алла перепутала строки и столбцы местами. С каждым бывает. Помогите
ей исправить баг.

Есть матрица размера m × n. Нужно написать функцию, которая её транспонирует.
Транспонированная матрица получается из исходной заменой строк на столбцы.
Например, для матрицы А (слева) транспонированной будет следующая
матрица (справа) (см. рисунок)

Формат ввода
В первой строке задано число n — количество строк матрицы.
Во второй строке задано m — число столбцов, m и n не превосходят 1000.
В следующих n строках задана матрица. Числа в ней не превосходят
по модулю 1000.

Формат вывода
Напечатайте транспонированную матрицу в том же формате, который задан во
входных данных. Каждая строка матрицы выводится на отдельной строке,
элементы разделяются пробелами.
"""

n = int(input())  # Origin Rows
m = int(input())  # Origin Cols
origMatrix = []
for i in range(n):
    origMatrix.append(input().split())

for j in range(m):
    for i in range(n):
        print(origMatrix[i][j], end=" ")
    print()
